Repository: FPGAwars/collection-default
Catalog: locale/*/*.po
Languages: cs_cz, es_es

source: Logic
cs_cz: Log
es_es: Lógica

source: Constant bit 0
es_es: Bit 0 constante

source: Constant bit 1
es_es: Bit 1 constante

source: Combinational
cs_cz: Kombinační
es_es: Combinacional

source: Gate
cs_cz: Hradlo
es_es: Puerta

source: Sequential
cs_cz: Sekvenční
es_es: Secuencial

source: 2-to-1 Multplexer (1-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 1 bit). Implementación en Verilog

source: Two bits input And gate
es_es: Puerta And de entrada de dos bits

source: Nand-x02: two input NAND gate. Verilog implementation
es_es: Nand-x02: Puerta NAND de dos entradas. Implementación en verilog

source: Nor-x02-verilog: 2 input NOR gate. Verilog implementation
es_es: Nor-x02-verilog: Puerta NOR de dos entradas. Implementación en verilog

source: NOT gate (Verilog implementation)
es_es: Puerta NOT (Implementación en verilog)

source: Input
es_es: Entrada

source: Output
es_es: Salida

source: OR2: Two bits input OR gate
es_es: OR2: Puerta OR de entrada de 2 bits

source: XOR gate: 2-bits input xor gate. Verilog implementation
es_es: XOR-gate: Puerta XOR de 2-bits. Implementación en verilog

source: Debouncer
cs_cz: Filtr zákmitů
es_es: Antirrebotes

source: Remove the rebound on a mechanical switch
cs_cz: Odstraní zákmity na tlačítku
es_es: Eliminar los rebotes en los pulsadores mecánicos

source: Edges detector. It generates a 1-period pulse (tic) when either a rising edge or a falling edge is detected on the input. Block implementation
es_es: Detector de flancos. Genera un pulso de 1 ciclo (tic) cuando llega un flanco de subida o uno de bajada por la entrada. Implementación con bloques

source: XOR gate: two bits input xor gate
es_es: XOR gate: Puerta XOR de dos bits de entrada

source: System - D Flip-flop. Capture data every system clock cycle. Verilog implementation
es_es: Biestable D del sistema. Captura el data en cada ciclo del sistema. Implementación en verilog

source: DFF. D Flip-flop. Verilog implementation
es_es: DFF. Biestable D (Implementación en Verilog)

source: 16-bits Syscounter with reset
es_es: Contador del sistema de 16 bits con reset

source: Inc1-16bit: Increment a 16-bits number by one
es_es: Inc1-16bit: Incrementar un número de 16-bits en uno

source: AdderK-16bit: Adder of 16-bit operand and 16-bit constant
es_es: AdderK-16bit: Sumador de un operando y una constante de 16 bits

source: Generic: 16-bits generic constant
es_es: Generic: Constante genérica de 16-bits

source: Adder-16bits: Adder of two operands of 16 bits
es_es: Adder-16bits: Sumador de dos operandos de 16 bits

source: Bus16-Split-half: Split the 16-bits bus into two buses of the same size
es_es: Bus16-Split-half: Dividir el bus de 16 bits en dos buses del mismo tamaño

source: Adder-8bits: Adder of two operands of 8 bits
es_es: Adder-8bits: Sumador de dos operandos de 8 bits

source: Bus8-Split-half: Split the 8-bits bus into two buses of the same size
es_es: Bus8-Split-half: Separar el bus de 8 bits en dos buses del mismo tamaño

source: Adder-4bits: Adder of two operands of 4 bits
es_es: Adder-4bits: Sumador de dos operandos de 4 bits

source: Adder-1bit: Adder of two operands of 1 bit
es_es: Adder-1bit: Sumador de dos operandos de 1 bit

source: AdderC-1bit: Adder of two operands of 1 bit plus the carry in
es_es: AdderC-1bit: Sumador de dos operandos de 1 bit más el acarreo de entrada

source: Bus4-Split-all: Split the 4-bits bus into its wires
es_es: Bus4-Split-all: Dividir el bus de 4-bits en sus cuatro cables

source: Bus4-Join-all: Join all the wires into a 4-bits Bus
es_es: Bus4-Join-all: Agrupar todos los cables en un bus de 4-bits

source: Bus8-Join-half: Join the two same halves into an 8-bits Bus
es_es: Bus8-Join-half: Agrupar las dos mitades en un bus de 8 bits

source: AdderC-4bits: Adder of two operands of 4 bits and Carry in
es_es: AdderC-4bit: Sumador de dos operandos de 4 bit más el acarreo de entrada

source: AdderC-8bits: Adder of two operands of 8 bits and Carry in
es_es: AdderC-8bit: Sumador de dos operandos de 8 bit más el acarreo de entrada

source: Bus16-Join-half: Join the two same halves into an 16-bits Bus
es_es: Bus 16-Join-half: Unir las dos mitades en un bus de 16-bits

source: 16-Sys-reg-rst: 16 bits system register with reset. Verilog implementation
es_es: 16-Sys-reg-rst: Registro del sistema de 16 bits con entradas de reset. Implementación en Verilog

source: Edge detector
es_es: Detector de flancos

source: Whenever there is a change in the input, the counter is started
es_es: En cuanto hay un cambio en la entrada, el contador se arranca

source: If the counter reaches it maximum value, the input is considered stable and it is captured
es_es: Si el contador alcanza su máximo valor, la entrada se considera estable y se captura

source: ### Time calculation For CLK=12MHZ, a 16-bit counter reaches its maximum every 2 ** 16 * 1/F = 5.5ms aprox IF more time is needed for debouncing, use a counter with more bits (17, 18...)
es_es: ### Cálculo del tiempo Para CLK=12MHZ, un contador de 16-bits alcanza su máximo cada 2 ** 16 * 1/F = 5.5ms aprox Si se necesita más tiempo para el antirrebotes, usar un contador con más bits (17, 18...)

source: ## Debouncer A value is considered stable when there is no changes during 5.5ms aprox. When a value is stable it is captured on the output flip-flop
es_es: ## Antirrebotes Un valor se considera estable cuando no hay cambios durante 5.5ms aprox. Cuando un valor es estable se captura en la salida del Biestable

source: Stable output
es_es: Salida estable

source: Counter
es_es: Contador

source: ## Edges detector It generates a 1-period pulse (tic) when an edge (Rising or falling) is detected on the input signal
es_es: ## Detector de flancos Se genera un pulso de 1-periodo (tic) cuando un flanco (de subida o de bajada) se detecta en la señal de entrada

source: Input signal
es_es: Señal de entrada

source: System clock
es_es: Reloj del sistema

source: Current signal state
es_es: Estado actual de la señal

source: Signal state in the previous clock cycle
es_es: Estado de la señal en el ciclo previo de reloj

source: The output is 1 if the current value is 1 and the previous 0, or if the current value is 0 and the previous 1
es_es: La salida es 1 si el valor actual es 1 y el anterior 0, o si el valor actual es 0 y el anterior 1

source: In any other case the output is 0
es_es: En cualquier otro caso la salida es 0

source: Parameter: Initial value
es_es: Parámetro: Valor inicial

source: Input data
es_es: Datos de entrada

source: # D Flip-Flop (system) It stores the input data that arrives at cycle n Its output is shown in the cycle n+1
es_es: # Biestable D (Sistema) Almacena el dato de entrada que llega en el ciclo n Su salida se muestra en el ciclo n+1

source: Not connected
es_es: Sin conectar

source: Flip-flop-D
es_es: Biestable D

source: Flip-flop-T
es_es: Biestable T

source: Sys-TFF: System TFF: It toogles its output on every system cycle. Verilog implementation
es_es: Biestable T del sistema: Cambia su salida en cada ciclo de reloj del sistema. Implementación en verilog

source: 22-bits prescaler
cs_cz: 22 bitová dělička
es_es: Prescaler de 22 bits

source: Parametric N-bits prescaler
cs_cz: Nastavitelná N bitová dělička
es_es: Prescaler de N bits

source: ECP5 FPGA internal pull-up configuration on the connected input port
es_es: Configuración de pull-up interno de la FPGA en el puerto de entrada. Familia ECP5

source: Pull-up_ICE40:: FPGA internal pull-up configuration on the input port. ICE40 FPGA family
es_es: Pull-up_ICE40:: Configuración del pull-up interno de la FPGA en el puerto de entrada. FPGAs de la familia ICE40

source: ### Pull-up parameter: 0: No pull-up 1: Pull-up activated
es_es: ### Parámetro pullup: 0: Sin pull-up 1: Pull-up activado

source: Only an FPGA pin can be connected here!!!
es_es: Sólo se puede conectar aquí un pin de la FPGA!!!

source: The pull-up is connected by default
es_es: El pull-up está conectado por defecto

source: Tri-state
cs_cz: Třístavová logika
es_es: Triestado

source: InOut: Input-Output block
es_es: InOut: Bloque de Entrada/Salida

source: 1. Basic
cs_cz: 1. Základ
es_es: 1. Básico

source: 2. Flip-flops
cs_cz: 2. Klopné obvody
es_es: 2. Biestables

source: 3. Gates
cs_cz: 3. Hradla
es_es: 3. Puertas

source: 4. Muxes
cs_cz: 4. Multiplexory
es_es: 4. Multiplexores

source: 01. One LED
cs_cz: 01. Jedna LED
es_es: 01. Un LED

source: Turn on a LED
cs_cz: Zapnout LED
es_es: Encender un LED

source: 02. Two LEDs
cs_cz: 02. Dvě LED
es_es: 02. Dos LEDs

source: Turn on two LEDs
cs_cz: Zapnout dvě LEDky
es_es: Encender dos LEDs

source: 03. Three LEDs
cs_cz: 03. Tři LED
es_es: 03. Tres LEDs

source: Turn on three LEDs
cs_cz: Zapnout tři LEDky
es_es: Encender tres LEDs

source: 04. One LED blink
cs_cz: 04. Jedna blikající LED
es_es: 04. Parpadeo de un LED

source: Blinking LED
cs_cz: Blikání LED
es_es: LED parpadeante

source: 05. Two LEDs alternate blink
cs_cz: 05. Dvě střídavě blikající LEDky
es_es: 05. Dos LEDs parpadeando alternativamente

source: LEDs 0 and 7 are blinking alternatively
cs_cz: LED číslo 0 a 7 střídavě blikají
es_es: Los LEDs 0 y 7 parpadean alternativamente

source: 06. Pushbutton and LED
cs_cz: 06. Tlačítka a LEDky
es_es: 06. Pulsador y LED

source: One pushbutton for turning the LED on and off
cs_cz: Jedno tlačítko pro zapínání i vypínání LED
es_es: Un pulsador para encender y apagar el LED

source: 01. DFF manual load
cs_cz: 01. Klopný D s ručním překlopením
es_es: 01. Biestable D con carga manual

source: Button-tic: Configurable button that emits a tic when it is pressed
es_es: Button-tic: Botón configurable que emite un tic cuando se aprieta

source: Rising-edge detector. It generates a 1-period pulse (tic) when a rising edge is detected on the input. Block implementation
es_es: Detector de flanco de subida. Se genera un pulso de 1-ciclo cuando se detecta un flanco de subida en la entrada. Implementación con bloques

source: Configurable button (pull-up on/off. Not on/off)
es_es: Botón configurable (pull-up on/off. NOT on/off)

source: FPGA internal pull-up configuration on the input port
es_es: Configuración de los pull-ups internos de la FPGA en el puerto de entrada

source: Select positive or negative logic for the input (0=positive, 1=negative)
es_es: Seleccionar lógica positiva o negativa para la entrada (0=positiva, 1=negativa)

source: Sync-x01: 1-bit input with the system clock domain (Verilog implementation)
es_es: Sync-x01: Sincronizar una entrada de 1-bit con el reloj del sistema (Implementación en verilog)

source: The LED is turned on when the pushbutton is pressed
cs_cz: Když se stiskne tlačítko, LED se rozsvítí
es_es: Se enciende el LED al apretar el pulsador

source: special debouncer for buttons
es_es: Antirrebotes especial para pulsadores

source: Button state signal
es_es: Señal de estado del Pulsador

source: Tic: button pressed
es_es: Tic: Botón apretado

source: Rising edge detector
es_es: Detector de flanco de subida

source: Pull up on/off
es_es: Pull up activada/desactivada

source: Not on/off
es_es: Not activada/desactivada

source: ## Rising edge detector It generates a 1-period pulse (tic) when a rising edge is detected on the input signal
es_es: ## Detector de flanco de subida Se genera un pulso de un periodo (tic) cuando se detecta un flanco de subida en la señal de entrada

source: If the current signal is 1 and its value in the previous clock cycle was 0, it means that a rising edge has been detected! The output es 1 In any other case the output is 0
es_es: Si la señal actual es 1 y sus valor en el ciclo anterior era 0, significa que se ha detectad un flanco de subida! Salida es 1 En cualquier otro caso la salida es 0

source: **Delay**: 0 clock cycles There is no delay between the arrival of a rising edge and its detection
es_es: **Delay**: 0 ciclos de reloj No hay retraso entre la llegada del flanco de subida y su detección

source: Internal pull-up * 0: OFF * 1: ON
es_es: Pull-up interno * 0: Apagado * 1: Activado

source: Synchronization stage
es_es: Etapa de sincronización

source: Normalization stage * 0: Wire * 1: signal inverted
es_es: Etapa de normalización * 0: Cable * 1: Señal invertida

source: Debouncing stage
es_es: Etapa antirrebotes

source: When k=0, it works like a wire (The output is equal to the input) When k=1, it act as a not gate (The output is the inverse of the input)
es_es: Cuando k=0, funciona como un cable (La salida es igual a la entrada) Cuando k=1, se comporta como una puerta NOT (La salida es la inversa de la entrada)

source: ### Truth table for XOR | k | input | output | function | |---|-------|--------|----------| | 0 | 0 | 0 | wire | | 0 | 1 | 1 | wire | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |
es_es: ### Tabla de verdad de la XOR | k | Entrada | Salida | Función | |---|-------|--------|----------| | 0 | 0 | 0 | wire | | 0 | 1 | 1 | wire | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |

source: 02. Chain of three DFFs
cs_cz: 02. Zřetězení tří klopných D
es_es: 02. Tres biestables D en serie

source: A chain of three D flip-flops The LEDs are turned on secuentially, with every click on the button
es_es: Tres biestables tipo D en serie Los LEDs se encienden secuencialmente, con cada pulsación del botón

source: 03. Ring of four DFFs
cs_cz: 03. Čtyři klopné D dokola
es_es: 03. Cuatro biestables D en anillo

source: Simplified-Heart-tic-ms-sys-32bits: Nominal periodic signal in mili seconds
es_es: Simplified-Heart-tic-ms-sys-32bits: Señal periódica nominal en milisegundos

source: Unit-ms-32bits: ms to cycles converter
es_es: Unit-ms-32bits: Conversor de ms a ciclos

source: Heart-sys-zero-32bits: Generate a periodic signal of period T cycles. It starts at cycle 0. It never stops
es_es: Heart-sys-zero-32bits: Generar una señal periódica de periodo de T ciclos. Comienza en el ciclo 0. No para nunca

source: Sys-Delay-xN-32bits: The input tic is delayed N cycles
es_es: Sys-Delay-xN-32bits: El tic de entrada se retrasa N ciclos

source: Counter-M-x32: 32-bits M module counter with reset
es_es: Counter-M-x32: Contador módulo M de 24-bits, con reset

source: Inc1-32bit: Increment a 32-bits number by one
es_es: Inc1-32bit: Incrementar un número de 32-bits en uno

source: AdderK-32bit: Adder of 32-bit operand and 32-bit constant
es_es: AdderK-32bit: Sumador de un operando y una constante de 32 bits

source: Generic: 32-bits generic constant
es_es: Generic: Constante genérica de 32-bits

source: Adder-32bits: Adder of two operands of 32 bits
es_es: Adder-32bits: Sumador de dos operandos de 32 bits

source: Bus24-Join-8-16: Join the two buses into an 24-bits Bus
es_es: Bus24-Join-8-16: Juntar los dos buses en uno de 24-bits

source: Bus32-Split-8-24: Split the 28-bits bus into two buses of 8 and 24 wires
es_es: Bus32-Split-8-24: Separar el bus de 28-bits en dos buses de 8 y 24 cables

source: Bus24-Split-16-8: Split the 24-bits bus into two buses of 16 and 8 wires
es_es: Bus24-Split-16-8: Separar el bus de 24-bits en dos buses de 16 6 8 cables

source: Bus32-Join-8-24: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-8-24: Juntar los dos buses en uno de 32-bits

source: Geu-32-Bits_v: 32-bit Unsigned Greather than or equal comparator. Verilog implementation
es_es: Geu-32-Bits_v: Comparador mayor o igual que, de 32-bits. Implementación en Verilog

source: 32-Reg-rst: 32 bits Register with reset. Verilog implementation
es_es: 32-Reg-rst: Registro de 32 bits con reset. Implementación en verilog

source: RS-FF-set-verilog. RS Flip-flop with priority set. Implementation in verilog
es_es: RS-FF-set-verilog. Biestable RS con prioridad en el set. Implementación en verilog

source: start: Start signal: It goes from 1 to 0 when the system clock starts. 1 cycle pulse witch. Block implementation
es_es: start: Señal de start. Pasa de 1 a 0 cuando el reloj del sistema comienza. Anchura de un ciclo. Implementación con bloques

source: A ring of four D flip-flops The sequence is shown in the LEDs
cs_cz: Čtyři klopné D dokola Posloupnost je zobrazena na LEDkách
es_es: Cuatro biestables D en anillo La secuencia se muestra en los LEDs

source: Input parameter: Milieconds
es_es: Parámetro de entrada: Milisegundos

source: Input parameter: System Frequency
es_es: Parámetro de entrada: Frecuencia del sistema

source: Delay
es_es: Retraso

source: Start a new period
es_es: Comienzo de un nuevo periodo

source: Start at cycle 0!
es_es: Comienza en el ciclo 0!

source: Repeat!
es_es: Repetir!

source: Current period ended Start a new one
es_es: Periodo actual terminado Comenzar uno nuevo

source: Periodo (in system clock cycles)
es_es: Periodo (en ciclos del reloj del sistema)

source: Current cycle in the period (0-T-1)
es_es: Ciclo actual en el periodo (0-T-1)

source: Cycles to delay
es_es: Ciclos de retraso

source: Delay finished!
es_es: Retraso finalizado!

source: Machine state: ON/OFF
es_es: Máquina de estados: ON/OFF

source: RS Flip-Flop
es_es: Biestable RS

source: Circuit state: * ON: working (1) * OFF: Not working (0)
es_es: Estado del circuito: * ON: en funcionamiento(1) * OFF: Parado (0)

source: The counter has reached the number of cycles to delay
es_es: El contador ha alcanzado el número de ciclos a retrasar

source: Maximum count reached
es_es: Cuenta máxima alcanzada

source: 32-bits register
es_es: Registro de 32-bits

source: If the max count is reached and the cnt tic is received, the register is reset to 0
es_es: Si se alcanza la cuenta máxima y se recibe un tic por cnt, el registro se inicializa a 0

source: External reset
es_es: Reset externo

source: Initial value: 1
es_es: Valor inicial : 1

source: Initial value: 0
es_es: Valor inicial: 0

source: Falling edge
es_es: Flanco de bajada

source: 04. Toggle button
cs_cz: 04. Přepínací tlačítko
es_es: 04. Botón de cambio

source: TFF-verilog. System TFF with toggle input: It toogles on every system cycle if the input is active. Verilog implementation
es_es: TFF-verilog. Biestable T del sistema con entrada de cambio: cambia en cada ciclo del reloj del sistema si la entrada está activada. Implementación en verilog

source: When the pushbutton is clicked the LED changes
cs_cz: Po stisknutí tlačítka se LED změní
es_es: Al apretar el pulsador el LED cambia

source: 05. Binary counter with three TFFs
cs_cz: 05. Binární čítač s třemi klopnými T
es_es: 05. Contador binario con tres biestables T

source: Falling-edge detector. It generates a 1-period pulse (tic) when a falling edge is detected on the input
es_es: Detector de flancos. Genera un pulso de 1 ciclo (tic) cuando llega un flanco de subida o uno de bajada por la entrada

source: A 3-bit binary counter with T flip-flops
cs_cz: Tříbitový binární čítač s klopnými T
es_es: Un contador binario de 3 bits con biestables tipo T

source: ## Falling edge detector It generates a 1-period pulse (tic) when a falling edge is detected on the input signal
es_es: ## Detector de flancos Se genera un pulso de 1-periodo (tic) cuando un flanco (de subida o de bajada) se detecta en la señal de entrada

source: If the current signal is 0 and its value in the previous clock cycle was 1, it means that a falling edge has been detected! The output es 1 In any other case the output is 0
es_es: Si la señal actual es 1 y su valor en el ciclo anterior era 0, significa que se ha detectado un flanco de subida! La salida es 1 En cualquier otro caso la salida es 0

source: **Delay**: 0 clock cycles There is no delay between the arrival of a falling edge and its detection
es_es: **Retardo**: 0 ciclos de reloj No hay retraso entre la llegada de un flanco de subida and su detección

source: 01. AND gate
cs_cz: 01. Hradlo AND
es_es: 01. Puerta AND

source: Testing the AND gate
cs_cz: Testování logického součinu AND
es_es: Probando la puerta AND

source: 02. OR gate
cs_cz: 02. Hradlo OR
es_es: 02. Puerta OR

source: Testing the OR gate
cs_cz: Testování logického součtu OR
es_es: Probando la puerta OR

source: 03. AND truth table
cs_cz: 03. Pravdivostní tabulka AND
es_es: 03. Tabla de verdad de la puerta AND

source: Truth table of the AND gate
cs_cz: Pravdivostní tabulka logického součinu AND
es_es: Tabla de verdad de la puerta Y

source: 04. OR truth table
cs_cz: 04. Pravdivostní tabulka OR
es_es: 04. Tabla de verdad de la puerta OR

source: Truth table of the OR gate
cs_cz: Pravdivostní tabulka logického součtu OR
es_es: Tabla de verdad de la puerta O

source: 05. Multiplexer 2-1
es_es: 05. Multiplexor 2-1

source: NOT logic gate
cs_cz: Invertor
es_es: Puerta lógica NOT

source: AND logic gate
cs_cz: Hradlo AND
es_es: Puerta lógica AND

source: OR logic gate
cs_cz: Hradlo OR
es_es: Puerta lógica OR

source: Simplified-Heart-ms-sys-32bits: Nominal periodic signal in mili seconds
es_es: Simplified-Heart-tic-ms-sys-32bits: Señal periódica nominal en milisegundos

source: SR1-32bits: Shift a 32-bit value one bit right. MSB is filled with the input in
es_es: SR1-32bits: Desplazar un valor de 32-bits un bit a la derecha. El bit de mayor peso se rellena con la entrada in

source: Bus32-Split-31-1: Split the 32-bits bus into two buses of 31 and 1 wires
es_es: Bus32-Split-31-1: Separar el bus de 32-bits en dos buses de 31 y 1 cables

source: Bus32-Join-1-31: Join the two buses into an 32-bits Bus
es_es: Bus32-Join-1-31: Juntar los dos buses en uno de 32-bits

source: Mux 2:1 implemented with logic gates The LED0 blinks or is turned on depending on the pushbutton 1
es_es: Multiplexor 2:1 implementado con puertas lógicas El LED 0 parpadea o se queda encendido dependiendo del pulsador 1

source: Mux 2:1 with logic gates
cs_cz: Multiplexor 2:1 pomocí logických hradel
es_es: Multiplexor 2:1 con puertas lógicas

source: Signal for blinking the LED
cs_cz: Signál pro blikání LED
es_es: Señal para que el LED parpadee

source: Fixed signal for turning on the LED
cs_cz: Stabilní signál pro zapnutí LED trvale
es_es: Señal fija para encender el LED

source: 06. Decoder 2-4
es_es: 06. Decodificador 2-4

source: 2 to 4 bits decoder with logic gates
cs_cz: Dekodér 2 na 4 bity pomocí logických hradel
es_es: Decodificador de 2 a 4 con puertas lógicas

source: 07. One bit adder
es_es: 07. Sumador de 1 bit

source: 1-bit adder
cs_cz: Jednobitová sčítačka
es_es: Sumador de 1 bit

source: 01. Blinking fixed LED
cs_cz: 01. Ne/blikající LED
es_es: 01. LED parpadeante/fijo

source: Blinking/fixed LED The toggle button selects if the LED blinks or stays turned on
es_es: LED parpadeante/fijo El pulsador selecciona si el LED parpadea o se queda encendido

source: 02. LED three states
cs_cz: 02. Třístavová LED
es_es: 02. LED en tres estados

source: The LED has three modes of operation: blinking, turned on an turned off SW2 pushbutton determines if the LED blinks/stays fixed SW1 pushbutton determines the LED state (on or off), in fixed mode
es_es: El LED tiene tres modos de operacion: parpadeando, encendido y apagado El pulsador SW2 determina si el LED parpadea o permanece fijo El pulsador SW1 determina el estado del LED (encendido o apagado), en el modo fijo

source: 03. Multiplexer 4-1
es_es: 03. Multiplexor 4-1

source: A 4:1 mux from two 2:1 muxes The LED can be in four states: off, blinking, on, blinking fast
es_es: Un multiplexor 4:1 creado a partir de dos multiplexores 2:1 El LED puede estar en cuatro estados: apagado, parpadeando, encendido y parpadeando rápido

source: 04. Shift register
cs_cz: 04. Posuvný registr
es_es: 04. Registro de desplazamiento

source: 4 bits shift register. It is loaded with the initial value 1000 and then shifted on every clock pulse
cs_cz: Čtyřbitový posuvný registr. Je nastaven na počáteční hodnotu 1000 a pak se posouvá na každý hodinový cyklus
es_es: Registro de desplazamiento de 4 bits. Se carga con el valor inicial 1000 y después se desplaza con cada ciclo del reloj
