Repository: FPGAwars/collection-default
Catalog: locale/*/*.po
Languages: cs_cz, es_es

source: Binary value to load and shift
cs_cz: Binární hodnota k načtení a posunutí
es_es: Valor binario a cargar y desplazar

source: Initializer. It has the initial value 0, so that the i0 is selected in all the muxes. The register is loaded. In the next cycle, it has the value 1, so the i1 input is selected in all the muxes. The register is shifted. In the next cycles it will remain in the shift state
cs_cz: Inicializátor. Jeho počáteční hodnota je 0, takže hodnota i0 je zvolena na všech multiplexorech. Registr je načten. V dalším cyklu má hodnotu 1, takže je vstup i1 zvolen na všech multiplexorech. Registr je posunut. V dalších cyklech zůstane ve stavu posouvání.
es_es: Inicializador. Tiene el valor inicial 0, de forma que i0 se selecciona en todos los multiplexores. El registro se carga. En el siguiente ciclo, tiene el valor 1, por lo que la entrada i1 se selecciona en todos los multiplexores. El registro se desplaza En el siguiente ciclo permanecerá en el estado de desplazamiento

source: 01. Headers list fonts
cs_cz: 01. Hlavičky, seznamy a písma
es_es: 01. Encabezados, listas y fuentes

source: # Markdown example This is an example of an information block written in markdown Just doble-click on this note to edit it ## Font styles In markdown you can write in **bold** or *italic* font very easily ## List Example of lists ### unordered * Item 1 * Item 2 * Item 2a * Item 2b ### ordered 1. Item 1 1. Item 2 1. Item 3 1. Item 3a 1. Item 3b 2. Item 3c
es_es: # Ejemplo de Markdown Este es un ejemplo de un bloque de información escrito en markdown. Simplemente haz doble clic en esta nota para editarla ## Estilos de fuente En markdown, puedes escribir en **negrita** o *cursiva* muy fácilmente ## Lista Ejemplo de listas ### desordenada * Artículo 1 * Artículo 2 * Artículo 2a * Artículo 2b ### ordenada 1. Artículo 1 1. Artículo 2 1. Artículo 3 1. Artículo 3a 1. Artículo 3b

source: 02. Links and images
cs_cz: 02. Odkazy a obrázky
es_es: 02. Enlaces e imágenes

source: ### Link example You can find **more information** about Markdown in this page: [Mastering markdown](https://guides.github.com/features/mastering-markdown/)
cs_cz: ### Příklad odkazu **Více informací** o Markdownu můžete nalézt na této stránce: [Mastering markdown](https://guides.github.com/features/mastering-markdown/)
es_es: ### Ejemplo de enlace Puedes encontrar **más información** sobre Markdown en esta página: [Mastering markdown](https://guides.github.com/features/mastering-markdown/)

source: ### Images :smiley: It is also possible to include images, but they are only rendered if there is internet connection
cs_cz: ### Obrázky :smiley: Je možné vkládat obrázky, ale ty se vykreslí jen s připojením na internet
es_es: ### Imágenes :smiley: También es posible incluir imágenes, pero solo se muestran si hay conexión a Internet

source: **PNG image**
cs_cz: **PNG rastrový obrázek**
es_es: **Imagen PNG**

source: **SVG image**
cs_cz: **SVG vektorový obrázek**
es_es: **Imagen SVG**

source: **Animated GIF**
cs_cz: **Animovaný GIF**
es_es: **GIF animado**

source: 03. Tables
cs_cz: 03. Tabulky
es_es: 03. Tablas

source: First Header | Second Header ------------ | ------------- Content from cell 1 | Content from cell 2 Content in the first column | Content in the second column
cs_cz: První hlavička | Druhá hlavička ------------ | ------------- Obsah buňky 1 | Obsah buňky 2 Obsah prvního sloupce | Obsah druhého sloupce
es_es: Primer encabezado | Segundo encabezado ------------ | ------------- Contenido de la celda 1 | Contenido de la celda 2 Contenido en la primera columna | Contenido en la segunda columna

source: ## Tables Tables are really helpfull
cs_cz: ## Tabulky Tabulky jsou opravdu užitečné
es_es: ## Tablas Las tablas son muy útiles

source: **AND truth table**
cs_cz: **pravdivostní tabulka AND**
es_es: **Tabla de verdad AND**

source: **Output**
cs_cz: **Výstup**
es_es: **Salida**

source: 04. Code task list
cs_cz: 04. Zdrojové kódy a seznamy úkolů
es_es: 04. Código y lista de tareas

source: ## Code
cs_cz: ## Zdrojový kód
es_es: ## Código

source: - [x] Task 1 - [x] Task 2 - [x] Task 3 - [ ] this is an incomplete item
cs_cz: - [x] Úkol 1 - [x] Úkol 2 - [x] Úkol 3 - [ ] tento úkol ještě není hotov
es_es: - [x] Tarea 1 - [x] Tarea 2 - [x] Tarea 3 - [ ] este es un elemento incompleto

source: ## Task lists
cs_cz: ## Seznamy úkolů
es_es: ## Lista de tareas

source: 05. Youtube videos
cs_cz: 05. Youtubová videa
es_es: 05. Videos de Youtube

source: # Youtube Videos
cs_cz: # Youtubová videa
es_es: # Video de Youtube

source: It is possible to link to youtube videos just by adding a **standard link** to it: [https://www.youtube.com/watch?v=boXZusFCCIU](Video)
cs_cz: Je možné vkládat videjka z youtube pouhým vložením **běžného odkazu** na něj: [https://www.youtube.com/watch?v=boXZusFCCIU](Video)
es_es: Es posible enlazar los videos de youtube simplemente agregando un **enlace estándar**: [https://www.youtube.com/watch?v=boXZusFCCIU](Video)

source: or you can include the **video thumbnail** along with the **link** for playing it in the browser [![Click to see the youtube video](http://img.youtube.com/vi/boXZusFCCIU/0.jpg)](https://www.youtube.com/watch?v=boXZusFCCIU)
cs_cz: nebo lze vložit **video náhled** spolu s **odkazem** na jeho přehrání v prohlížeči [![Kliknutím zobrazíte video na Youtube](http://img.youtube.com/vi/boXZusFCCIU/0.jpg)](https://www.youtube.com/watch?v=boXZusFCCIU)
es_es: o puedes incluir la **miniatura de video** junto con el **enlace** para reproducirlo en el navegador [![Click para ver el video de youtube](http://img.youtube.com/vi/boXZusFCCIU/0.jpg)](https://www.youtube.com/watch?v=boXZusFCCIU)

source: 01. Four bits fixed binary value
cs_cz: 01. Čtyřbitová binární konstanta
es_es: 01. Valor fijo de 4 bits en binario

source: Displaying a 4-bits fixed value in the LEDs
cs_cz: Zobrazuje 4 bitovou konstantu pomocí LEDek
es_es: Mostrando un valor fijo de 4 bits en los LEDs

source: 02. Four bits fixed hexadecimal value
cs_cz: 02. Čtyřbitová šestnáctková konstanta
es_es: 02. Valor fijo de 4 bits en hexadecimal

source: Displaying a 4-bits fixed value (in hexadecimal) in the LEDs
cs_cz: Zobrazuje 4 bitovou konstantu (šestnáctkovou) pomocí LEDek
es_es: Mostrando un valor fijo de 4 bits (en hexadecimal) en los LEDs

source: 03. Eight bits fixed value buses
cs_cz: 03. Osmibitová konstanta na sběrnici
es_es: 03. Bus de 8 bits

source: Using buses for displaying a fixed value in the LEDs
cs_cz: Použití sběrnic k zobrazení konstanty pomocí LEDek
es_es: Usando un bus para mostrar un valor fijo en los LEDs

source: 04. Eight bits counter
cs_cz: 04. Osmibitový čítač
es_es: 04. Contador de 8 bits

source: An 8-bit binary counter
cs_cz: 8 bitový binární čítač
es_es: Un contador binario de 8 bits

source: 05. Split buses
cs_cz: 05. Rozdělení sběrnic
es_es: 05. División de buses

source: An 8-bit binary counter, using an 8-bit bus splitted into two 4-bit buses
es_es: Un contador binario de 8 bits, usando un bus de 8 bits dividido en dos buses de 4 bits

source: 06. ROM 16x8
cs_cz: 06. ROM 16x8 bitů
es_es: 06. ROM de 16x8

source: Displaying the contents of an 16x8 rom memory in the LEDs
cs_cz: Zobrazuje obsah rom paměti 16x8 bitů pomocí LEDek
es_es: Mostrando el contenido de una memoria ROM de 16x8 en los LEDs

source: 07. ROM 16x8 file
cs_cz: 07. ROM 16x8 bitů ze souboru
es_es: 07. ROM de 16x8 en fichero

source: Displaying the contents of an 16x8 rom memory in the LEDs The memory is read from the rom0.list file
es_es: Mostrando el contenido de una memoria ROM de 16x8 en los LEDs La memoria se lee del fichero rom0.list

source: 08. ROM 16x8 file generic
cs_cz: 08. ROM 16x8 bitů ze souboru
es_es: 08. ROM de 16x8 en fichero genérico

source: Displaying the contents of an 16x8 rom memory in the LEDs The memory is read from the rom0.list file
cs_cz: Zobrazuje obsah rom paměti 16x8 bitů pomocí LEDek Paměť je načtena ze souboru rom0.list
es_es: Mostrando el contenido de una memoria ROM de 16x8 en los LEDs La memoria se lee del fichero rom0.list

source: 09. ROM 16x8 table
cs_cz: 09. ROM 16x8 bitů tabulkou
es_es: 09. ROM de 16x8 en tabla

source: Displaying the contents of an 16x8 rom memory in the LEDs The memory is read from the given table
cs_cz: Zobrazuje obsah rom paměti 16x8 bitů pomocí LEDek Paměť je načtena z tabulky
es_es: Visualización del contenido de una memoria rom de 16x8 en los LEDs La memoria se lee de la tabla dada

source: Bit
cs_cz: Binární konstanta

source: Setup
cs_cz: Nastavení pinu

source: Assign 0 to the output wire
cs_cz: Přiřadí logickou 0 na výstupní spoj

source: Assign 1 to the output wire
cs_cz: Přiřadí logickou 1 na výstupní spoj

source: Mux 2:1
cs_cz: Multiplexor 2:1

source: NAND logic gate
cs_cz: Hradlo NAND

source: NOR logic gate
cs_cz: Hradlo NOR

source: NOT
cs_cz: negace

source: XNOR logic gate
cs_cz: Hradlo exkluzivní NOR

source: XOR logic gate
cs_cz: Hradlo exkluzivní OR

source: Flip-flop D
cs_cz: Synchronní klopný D

source: Delay flip-flop
cs_cz: Synchronní klopný D (zpožďující)

source: Flip-flop T
cs_cz: Synchronní klopný T

source: Toggle flip-flop
cs_cz: Synchronní klopný T (otáčející)

source: Prescaler22
cs_cz: Dělička 22

source: PrescalerN
cs_cz: Dělička N

source: FPGA internal pull-up configuration on the connected input port
cs_cz: FPGA vnitřní pull-up rezistor na připojeném vstupním pinu

source: Tri-state logic block
cs_cz: Třístavový logický blok

source: 5. Markdown
cs_cz: 5. Dokumentace (markdown)

source: 6. Verilog
cs_cz: 6. Programování (verilog)

source: A chain of three D flip-flops The LEDs are turned on secuentially, with every click on the button
cs_cz: Zřetězení tří klopných D Každým stisknutím tlačítka jsou LEDky bezpečně zapnuty

source: 05. SR latch
cs_cz: 05. Asynchronní klopný obvod SR

source: An SR-latch implemented with logic gates
cs_cz: Asynchronní klopný obvod SR pomocí logických hradel

source: 06. D latch
cs_cz: 06. Asynchronní klopný D

source: A D latch implemented with logic gates
cs_cz: Asynchronní klopný D pomocí logických hradel

source: 07. D flip-flop
cs_cz: 07. Synchronní klopný D

source: Master Latch
cs_cz: Hlavní asynchronní

source: Slave latch
cs_cz: Vedlejší asynchronní

source: A D flip-flip with a falling-edge trigger implemented with logic gates
cs_cz: Synchronní klopný D se sestupnou hranou pomocí logických hradel

source: 08. Multiplexer 2:1
cs_cz: 08. Multiplexor 2:1

source: Mux 2:1 implemented with logic gates The LED0 blinks or is turned on depending on the pushbutton 1
cs_cz: Multiplexor 2:1 pomocí logických hradel V závislosti na tlačítku 1 LED0 buď bliká, nebo je zapnuta

source: 09. Decoder 2:4
cs_cz: 09. Dekodér 4 ze 2

source: 10. One bit adder
cs_cz: 10. Jednobitová sčítačka

source: Blinking/fixed LED The toggle button selects if the LED blinks or stays turned on
cs_cz: Blikající/neblikající LED Přepínání tlačítkem vybere zda LED bliká či zůstane zapnuta

source: The LED has three modes of operation: blinking, turned on an turned off SW2 pushbutton determines if the LED blinks/stays fixed SW1 pushbutton determines the LED state (on or off), in fixed mode
cs_cz: LED má tři stavy: bliká, svítí, nesvítí tlačítko SW2 volí zda LED bliká či nebliká tlačítko SW1 volí, zda svítí či nesvítí, když nebliká

source: 03. Multiplexer 4:1
cs_cz: 03. Multiplexor 4:1

source: A 4:1 mux from two 2:1 muxes The LED can be in four states: off, blinking, on, blinking fast
cs_cz: Multiplexor 4:1 sestavený ze dvou multiplexorů 2:1 LED může být ve čtyřech stavech: nesvítí, bliká, svítí a bliká rychleji

source: # Markdown example This is an example of an information block written in markdown Just doble-click on this note to edit it ## Font styles In markdown you can write in **bold** or *italic* font very easily ## List Example of lists ### unordered * Item 1 * Item 2 * Item 2a * Item 2b ### ordered 1. Item 1 1. Item 2 1. Item 3 1. Item 3a 1. Item 3b
cs_cz: # Příklad dokumentace v Markdown Toto je příklad informačního bloku napsaného v markdownu Pro úpravu poklepejte myší ## Styl písma V markdownu můžete psát **tlustě** či *kurzívou* velmi snadno ## Seznam Příklad seznamů ### nečíslovaný * Položka 1 * Položka 2 * Položka 2a * Položka 2b ### číslovaný 1. Položka 1 1. Položka 2 1. Položka 3 1. Položka 3a 1. Položka 3b

source: Puerta AND
cs_cz: Hradlo AND

source: An 8-bit binary counter, using an 8-bit bus splitted into two 4-bit buses
cs_cz: 8 bitový binární čítač, používá 8 bitovou sběrnici rozdělenou na dvě 4 bitové

source: ### Images It is also possible to include images, but they are only rendered if there is internet connection
cs_cz: ### Obrázky Je možné vkládat obrázky, ale ty se vykreslí jen s připojením na internet

source: # Markdown example This is an example of an information block written in markdown Just doble-click on this note to edit it ## Font styles In markdown you can write in **bold** or *italic* font very easily ## List Example of lists ### unordered * Item 1 * Item 2 * Item 2a * Item 2b ### Unordered 1. Item 1 1. Item 2 1. Item 3 1. Item 3a 1. Item 3b
cs_cz: # Příklad dokumentace v Markdown Toto je příklad informačního bloku napsaného v markdownu Pro úpravu poklepejte myší ## Styl písma V markdownu můžete psát **tlustě** či *kurzívou* velmi snadno ## Seznam Příklad seznamů ### nečíslovaný * Položka 1 * Položka 2 * Položka 2a * Položka 2b ### číslovaný 1. Položka 1 1. Položka 2 1. Položka 3 1. Položka 3a 1. Položka 3b

source: ### Link example You can find information **more information** about Markdown in this page: [Mastering markdown](https://guides.github.com/features/mastering-markdown/)
cs_cz: ### Příklad odkazu **Více informací** o Markdownu můžete nalézt na této stránce: [Mastering markdown](https://guides.github.com/features/mastering-markdown/)

source: Leds 0 and 7 are blinking alternatively
cs_cz: LEDky číslo 0 a 7 blikají střídavě

source: Sum
cs_cz: Suma

source: Carry
cs_cz: Přenos

source: Delay flip-flop with synchronous reset
cs_cz: Synchronní klopný D se synchronním nulováním

source: FPGA internal pull up configuration on the connected input port
cs_cz: FPGA vnitřní pull-up rezistor na připojený vstup

source: Tri state
cs_cz: Tří stavový

source: 06. Pushbutton LED
cs_cz: 06. Tlačítko a LED

source: bit
cs_cz: Binární konstanta

source: config
cs_cz: Nastavení

source: logic
cs_cz: Logika

source: combinational
cs_cz: Kombinační

source: mux_2_1
cs_cz: Multiplexor 2:1

source: gate
cs_cz: Hradlo

source: not
cs_cz: negace

source: xor
cs_cz: Exkluzivní OR

source: sequential
cs_cz: sekvenční

source: dff
cs_cz: Synchronní klopný D

source: tff
cs_cz: Synchronní klopný T

source: debouncer
cs_cz: Filtr zákmitů

source: prescaler_22
cs_cz: Dělička 22

source: prescalerN
cs_cz: předdělička N

source: 1_basic
cs_cz: 1. Základy

source: 1_one_led
cs_cz: 1. Zapnout jednu led

source: 2_two_leds
cs_cz: 2. Zapnout dvě ledky

source: 3_three_leds
cs_cz: 3. Zapnout tři ledky

source: 4_blink
cs_cz: 4. Blikání

source: 5_two_led_alternate_blink
cs_cz: 5. Dvě střídavě blikající LEDky

source: 6_pushbutton_led
cs_cz: 6. Tlačítko a LED

source: 2_flip_flops
cs_cz: 2. Klopné obvody

source: 1_Dff_manual_load
cs_cz: 1. Klopný obvod D s ručním překlopením

source: 2_chain_of_three_DFF
cs_cz: 2. Zřetězení tří synchronních klopných obvodů D

source: 3_ring_of_four_DFFs
cs_cz: 3. Synchronní klopné obvody D dokola

source: 5_binary_counter_with_three_TFFs
cs_cz: 5. Binární čítač pomocí tří synchronních klopných obvodů T

source: 3_gates
cs_cz: 3. Hradla

source: 01_and
cs_cz: 1. Hradlo AND

source: 02_or
cs_cz: 2. Hradlo OR

source: 03_and_truth_table
cs_cz: 3. AND pravdivostní tabulkou

source: 04_or_truth_table
cs_cz: 4. OR pravdivostní tabulkou

source: 05_sr_latch
cs_cz: 5. Asynchronní klopný obvod SR

source: 06_D_latch
cs_cz: 6. Asynchronní klopný D

source: 07_D_flip_flop
cs_cz: 7. Synchronní klopný D

source: 08_mux_2_1
cs_cz: 8. Multiplexor 2:1

source: 09_two_to_four_decoder
cs_cz: 9. Dekodér 2 na 4

source: 10_one_bit_adder
cs_cz: 10. Jednobitová sčítačka

source: 4_muxes
cs_cz: 4. Multiplexování

source: 2_led_three_states
cs_cz: 2. Tří stavová LED

source: 3_mux_4_1
cs_cz: 3. Multiplexor 4:1

source: 4_shift_register
cs_cz: 4. Posuvný registr

source: 01_four_bits_fixed_binary_value
cs_cz: 1. Čtyřbitová binární konstanta

source: 02_four_bits_fixed_hexa_value
cs_cz: 2. Čtyřbitová šestnáctková konstanta

source: 03_eight_bits_fixed_value_buses
cs_cz: 3. Osmibitová konstanta na sběrnici

source: 04_eight_bits_counter
cs_cz: 4. Osmibitový čítač

source: 05_split_buses
cs_cz: 5. Rozdělení sběrnic

source: 06_rom16x8
cs_cz: 6. ROM 16x8 bitů

source: 07_rom16x8_file
cs_cz: 7. ROM 16x8 bitů ze souboru

source: 08_rom16x8_file_generic
cs_cz: 8. ROM 16x8 bitů ze souboru

source: 02_four_bits_fixed_binary_value
cs_cz: 2. Čtyřbitová binární konstanta

source: 2_Chain_of_three_DFF
cs_cz: 2. Zřetězení tří synchronních klopných D

source: 2_counter
cs_cz: 2_čítač

source: 1_led_on
cs_cz: 1_led_zapnout

source: 2_switch_led
cs_cz: 2_přepnout_led

source: 3_switch_and_gate
cs_cz: 3_přepnínací_hradlo_and

source: contadorAsc
cs_cz: čítačVzestupný

source: contadorDes
cs_cz: čítačSestupný
